(function(window) {

	window.App = (window.App || {});
	var $ = window.jQuery;

	function _on_dom_ready() {
//איך אני יכול לעשות datastore כמו שעשינו אז לשמירה ועדכון של המתשמשים או שעדיף בכלל בדרך אחרת
		//לסדר את הנגן שיעשה פאוס ולא כאילו סטופ שבפעם אחרי שעושים play הוא ימשיך מאותה נקודה.
		//איך אפשר לחבר נכון יותר את ה events של כל הכפתורים של הנגן והדיסק יותר נכון.
		//איך כדי לעשות את הvalidat אולי לחפש את הclass problem ואם יש לא לשלוח את התופס
		//איך לעשות את הקוד יותר מחולק ויותר קריא
	}

	$(_on_dom_ready);
})(window);

